#include<iostream>//Содержит потоки Ввода/Вывода - cin/cout
using namespace std;//cin/cout

//Директива - это указание компилятору на выполнение некоторых действий.
//Директива #include (включить в состав, или подключить)

void main()//эти скобки показывают что main - это функция
{
	cout << "Hello World!";
}

//main - это главная функция, которая является точкой входа программы,
//поскольку с нее начинается выполнение любой программы.
//Функция main ОБЯЗАТЕЛЬНО ДОЛЖНА БЫТЬ В ЛЮБОМ ПРОЕКТЕ, НО ТОЛЬКО ОДНА!!!

//void - пустота

//Ctrl + F7 - Компиляция
//Ctrl + F5 - Запуск